[Flags]
types_iscustom=Выборочный тип.\n\nУказывает инсталлятору, что тип является выборочным. Всякий раз,\nкогда пользователь вручную меняет состав компонентов при установке,\nинсталлятор меняет тип установки на выборочный. Обратите внимание,\nчто если вы не зададите выборочный тип установки, инсталлятор просто\nпредложит пользователю выбрать тип установки, и он не сможет поменять\nсостав входящих в выбранную установку компонентов.\n\nЭтот флаг может включать только один тип.
components_checkablealone=Выбирать без дочерних.\n\nЭтот флаг указывает, что компонент может быть выбран,\nдаже если не выбран ни один из дочерних элементов.\nПо умолчанию, если в скрипте нет ни каких параметров\n"Components" непосредственно ссылающихся на компонент,\nто отмена выбора для всех дочерних дочерних элементов\nсделает компонент не выбранным.
components_dontinheritcheck=Не наследовать выбор.\n\nОпределяет, что компонент не должен выбираться автоматически,\nесли выбирается его родительский компонент. Не влияет на\nкомпоненты верхнего уровня и не может использоваться\nсовместно с флагом "Исключительно" (exclusive).
components_exclusive=Исключительно.\n\nУказывает инсталлятору, что из двух и более дочерних\nкомпонентов, также имеющих флаг "Исключительно"\n(exclusive), может быть выбран только один.
components_fixed=Фиксирован.\n\nУказывает инсталлятору, что компонент с этим флагом не может\nбыть выбран или не выбран пользователем при установке.
components_restart=Перезагрузка\n\nУказывает инсталлятору, что при выборе пользователем\nэтого компонента следует перезагрузить компьютер\nпосле его установки, даже если в этом нет необходимости\n(например потому, что в секции [Files] могут находиться\nпараметры с флагом restartreplace). Действует так же,\nкак директива AlwaysRestart, только для компонентов.
components_disablenouninstallwarning=Отключить предупреждение.\n\nУказывает инсталлятору не предупреждать пользователя, что этот\nкомпонент не удалится после того, как он снимет с него флажок,\nесли этот компонент уже установлен на данном компьютере.\n\nВ зависимости от сложности компонентов можно попробовать\nиспользовать секцию "Удалить перед установкой" [InstallDelete] и этот\nфлаг для автоматического "удаления" компонентов со снятым флажком.
tasks_checkablealone=Выбирать без дочерних.\n\nЭтот флаг указывает, что задача может быть выбрана, даже если\nне выбрана ни одна из дочерних задач. По умолчанию, если в\nскрипте нет ни каких параметров "Tasks" непосредственно\nссылающихся на задачу, то отмена выбора для всех дочерних\nзадач автоматически делает задачу не выбранной.
tasks_checkedonce=Выбирается только один раз.\n\nУказывает инсталлятору, что данная задача не должна быть\nвыбрана в случае, когда инсталлятор обнаружит, что она уже\nустановлена вместе с предыдущей версией того же приложения.\nЭтот флаг не комбинируется с флагом "Не выбрано" (unchecked).\n\nЕсли директива UsePreviousTasks секции [Setup] имеет значение\n"no", этот флаг игнорируется.
tasks_dontinheritcheck=Не наследовать выбор.\n\nОпределяет, что задача не должна выбираться автоматически,\nесли выбирают ее родительскую задачу. Игнорируется для задач\nверхнего уровня и не может использоваться совместно с флагом\n"Исключительно" (exclusive).
tasks_exclusive=Исключительно.\n\nУказывает инсталлятору, что из двух и более дочерних\nзадач, также имеющих флаг "Исключительно" (exclusive),\nможет быть выбрано только одно.
tasks_restart=Перезагрузка.\n\nУказывает инсталлятору, что при выборе пользователем\nэтого задания следует перезагрузить компьютер после\nего установки, даже если в этом нет необходимости\n(например потому, что в секции "Файлы" [Files] могут\nнаходиться параметры с флагом "Заменять при перезагрузке"\n(restartreplace)). Действует так же, как директива\nAlwaysRestart, только для задач.
tasks_unchecked=Не выбрано.\n\nУказывает инсталлятору, что эта задача должна быть снята\nизначально. Этот флаг не может использоваться совместно\nс флагом "Выбирается только один раз" (checkedonce).
dirs_deleteafterinstall=Удалить после установки.\n\nУказывает инсталлятору создать обычную папку, но потом удалить\nее после завершения (или прервании) установки, если она будет\nпустая. Это может быть полезно, когда извлекаемые временные файлы\nнужны программе для выполнения в секции "Выполнить" [Run] скрипта.\n\nЭтот флаг не удалит файл, существующий до начала установки,\nпосле этой установки.
dirs_setntfscompression=Включить NTFS-сжатие для каталога.\n\nУказывает инсталлятору включить NTFS-сжатие для каталога.\nЕсли по какой-либо причине установить состояние сжатие невозможно\n(например, если сжатие не поддерживается файловой системой),\nто никаких сообщений об ошибке показано не будет.\n\nЕсли каталог уже существует, состояние сжатия файлов любых\nтипов, присутствующих в каталоге не будет изменено.
dirs_uninsalwaysuninstall=Всегда деинсталлировать.\n\nУказывает деинсталлятору всегда пытаться удалять\nкаталог, если он пустой. Обычно деинсталлятор\nпытается удалять каталог, только если он\nне существовал до установки.
dirs_uninsneveruninstall=Не деинсталлировать.\n\nУказывает деинсталлятору не удалять каталог.\nПо умолчанию деинсталлятор удаляет любой каталог,\nуказанный в секции "Директории" [Dirs], если он пустой.
dirs_unsetntfscompression=Отключить NTFS-сжатие для каталога.\n\nУказывает инсталлятору отключить NTFS-сжатие для каталога\nЕсли по какой-либо причине установить состояние сжатия\nневозможно (например, если сжатие не поддерживается файловой\nсистемой), то никаких сообщений об ошибке показано не будет.\n\nЕсли каталог уже существует, состояние сжатия файлов любых\nтипов, присутствующих в каталоге не будет изменено.
files_32bit=32 бит.\n\nУстанавливает для константы {sys} значение 32-битного системного\nкаталога при использовании параметров "Источник" (Source) и\n"Каталог назначения" (DestDir) , флаги "Зарегистрировать сервер OLE"\n(regserver) и "Зарегистрировать библиотеку типов" (regtypelib)\nобрабатывают файлы как 32-битные, и флаг "Общий файл" (sharedfile)\nобновляет ключ реестра для 32-битных общих библиотек.\nЭто значение по умолчанию при установке в 32-битном режиме.
files_64bit=64 бит.\n\nУстанавливает для константы {sys} значение 64-битного системного\nкаталога при использовании параметров "Источник" (Source) и\n"Каталог назначения" (DestDir) , флаги "Зарегистрировать сервер OLE"\n(regserver) и "Зарегистрировать библиотеку типов" (regtypelib)\nобрабатывают файлы как 64-битные, и флаг "Общий файл" (sharedfile)\nобновляет ключ реестра для 64-битных общих библиотек.\nЭто значение по умолчанию при установке в 64-битном режиме.
files_allowunsafefiles=Разрешить небезопасные файлы.\n\nОтменяет автоматическую проверку компилятором ненадежных файлов.\nСтрого рекомендуется НЕ ИСПОЛЬЗОВАТЬ этот флаг, если вы не очень\nпонимаете, зачем его ставите.
files_comparetimestamp=Сравнивать время.\n\n(Использование не рекомендуется, см. ниже)\nДает инсталлятору команду приступить к сравнению временных\n отметок, если устанавливаемый файл уже существует в системе\n пользователя, и по крайней мере одно условие выполняется:\n\n• У существующего и устанавливаемого файла нет информации о версии.\n• При этом в параметре используется флаг ignoreversion.\n• Флаг replacesameversion не используется, и существующий файл\nи устанавливаемый файл имеет тот же самый номер версии\n(который определяется информацией о версии файлов).\n\nЕсли существующий файл имеет более старую временную отметкк, чем\nустановленный файл, существующий файл будет заменен. В противном\n случае он не будет заменен.\n\nИспользовать этот флаг рекомендуется только в крайнем случае,\n потому что возможны негативные последствия: система NTFS\n использует временные отметки UTC (в отличие от FAT),\n вследствие чего локальные временные отметки - с которыми\n по умолчанию работает Inno Setup - меняются всякий раз,\n когда пользователь меняет часовой пояс или когда время\n отображается неправильно. Это может привести к ситуации,\n что файлы переместятся туда, где пользователь не ожидает\n их увидеть, или не переместятся, как ожидает пользователь.
files_confirmoverwrite=Подтвердить перезапись\n\nВсегда спрашивать у пользователя подтверждение\nпри замене существующего файла.
files_createallsubdirs=Создать все подкаталоги\n\nПо умолчанию компилятор пропускает пустые каталоги, имена которых совпадают\nс заданным именем/шаблоном и которые являются вложенными подкаталогами\nисходного каталога. Флаг "Создать все подкаталоги" (createallsubdirs) указывает\nинсталлятору создавать эти каталоги во время установки (точно так же, как если бы Вы\nсоздали их в секции "Файлы и каталоги" [Dirs].\n\nДолжен использоваться совместно с флагом "Обрабатывать подкаталоги" (recursesubdirs).
files_deleteafterinstall=Удалить после установки.\n\nУказывает инсталлятору устанавливать файл как обычно, но удалять\nего после завершения (или прервания) установки. Это может быть\nполезно, когда извлекаемые временные файлы нужны программе для\nвыполнения в секции [Run] скрипта.\n\nЭтот флаг не удалит файл, существующий до начала установки,\nпосле этой установки.\n\nЭтот флаг не комбинируется с флагами isreadme, regserver,\nregtypelib, restartreplace, sharedfile и uninsneveruninstall.
files_dontcopy=Не копировать.\n\nНе копировать файл на компьютер пользователя. Этот флаг\nполезен, если файл используется только в секции [Code],\nи извлечен с помощью ExtractTemporaryFile.
files_dontverifychecksum=Не проверять контрольную сумму.\n\nОтменяет проверку инсталлятором контрольной суммы\nфайла после извлечения. Используйте этот флаг на файлах,\nкоторые вы хотите изменить после компиляции дистрибутива.\n\nДолжен использоваться совместно с флагом\n"Не сжимать" (nocompression).
files_external=Внешний.\n\nЭтот флаг указывает Inno Setup не компилировать файл, указанный в\nкачестве источника в дистрибутив, а копировать уже существующий\nфайл из дистрибутива или с компьютера пользователя. См. описание\nпараметра "Источник" (Source) для получения дополнительной\nинформации.
files_fontisnttruetype=Не TrueType шрифт.\n\nУстановите этот флаг, если устанавливаете файл шрифта, который не\n является TrueType, в параметре "Установить шрифт" (FontInstall).
files_gacinstall=Глобальный кэш сборок .NET\n\nУстановить файл в глобальный кэш сборок .NET. При использовании\nв комбинации с sharedfile, файл будет удален только когда\nподсчет ссылок достигнет нуля.\n\nЧтобы удалить файл Деинсталлятор использует имя, заданное\nпараметром StrongAssemblyName.\n\nБудет вызвано исключение, если предпримется попытка использовать\nэтот флаг в системе без установленной Платформы .NET.
files_ignoreversion=Игнорировать версию.\n\nНе сверять версии; перемещать существующие файлы\nне обращая внимание на номера версий.\n\nЭтот флаг применим только к файлам вашего приложения,\nно не к общедоступным файлам.
files_isreadme=Это файл "README".\n\nФайл является файлом ReadMe. Только один файл в инсталляции может\nиметь этот флаг. Если файл имеет этот флаг, у пользователя будет\nспрошено, хочет ли он прочитать файл ReadMe после завершения установки.\nЕсли он выберет Да, инсталлятор откроет файл с помощью заданной\nпо умолчанию программы для его типа. Поэтому файл ReadMe должен\nиметь расширение .txt, .wri, или .doc (лучше всего .txt).\n\nОбратите внимание, что инсталлятор не должен перезагружать компьютер\nпользователя (после установки файла с флагом restartreplace или если\nдиректива AlwaysRestart секции [Setup] равна yes), пользователь\nне сможет прочитать файл ReadMe сразу после установки программы.
files_nocompression=Не сжимать.\n\nЗапрещает компилятору сжимать файл. Устанавливайте этот флаг\nдля файлов, про которые вы точно знаете, что их сжатие не даст\nрезультата (например, рисунки в формате JPEG), чтобы ускорить\nкомпиляцию и немного уменьшить размер дистрибутива.
files_noencryption=Не шифровать.\n\nЗапрещает компилятору шифровать файл. Установите этот файл, если Вы\nразрешили шифрование (используя директиву "Шифровать" (Encryption)\nв секции [Setup]) но хотите иметь возможность извлечь файл, используя\nфункцию ExtractTemporaryFile в секции "Код" [Code] прежде, чем\nпользователь введет правильный пароль.
files_noregerror=Игнорировать ошибки регистрации.\n\nВ комбинации с любым из флагов "Зарегистрировать сервер" (regserver)\nили "Зарегистрировать библиотеку типов" (regtypelib), инсталлятор не\nвыдаст сообщения о том, что регистрация не состоялась.
files_onlyifdestfileexists=Только если уже существует.\n\nУстанавливать файл только в том случае, если файл с таким именем уже\nсуществует на компьютере пользователя. Этот флаг может быть полезен, если\nваш дистрибутив является патчем к ранее установленной программе, и вы не\nхотите, чтобы устанавливались файлы, которых нет на компьютере пользователя.
files_onlyifdoesntexist=Только если не существует.\n\nУстанавливать файл только в том случае, если его\nеще нет на компьютере пользователя.
files_overwritereadonly=Перезаписывать "только для чтения"\n\nВсегда перезаписывает файл с арибутом "только для чтения".\nБез этого флага инсталлятор спросит пользователя, переписывать\nли ему уже установленный файл с арибутом "только для чтения".
files_promptifolder=Спросить, если старее.\n\nПо умолчанию, когда устанавливаемый файл имеет более поздний\nномер версии (или временную метку, если используется флаг\n"Сравнивать время" (comparetimestamp)), чем уже существующий файл,\nинсталлятор не переместит существующий файл. При использовании\nэтого флага инсталлятор спросит пользователя, какой из файлов следует\nпереместить, с ответом по умолчанию оставить существующий файл.
files_recursesubdirs=Обрабатывать подкаталоги.\n\nУказывает компилятору или инсталлятору также искать файлы с тем\nже именем/маской в подпапках папки, указанной в параметре Source.
files_regserver=Зарегистрировать сервер OLE.\n\nРегистрация OLE-сервера (он же ActiveX control). Если этот флаг\nустановлен, инсталлятор найдет и выполнит DllRegisterServer для DLL/OCX.\nДеинсталлятор вызовет DllUnregisterServer. При использовании в\nкомбинации с флагом "Общий файл" (sharedfile), DLL/OCX будет только\nдерегистрирована, когда связывающий счетчик достигнет нуля.\n\nВ режиме установки 64-бит файл считается образом 64-бит\nи будет зарегистрирован внутри процесса 64-бит.\nЭто можно изменить, указав флаг 32-бит.
files_regtypelib=Зарегистрировать библиотеку типов.\n\nРегистрация библиотеки типов (.tlb). Деинсталлятор дерегистрирует\nбиблиотеку типов (если только не указан флаг uninsneveruninstall).\nКак и флаг "Зарегистрировать сервер OLE" (regserver), в комбинации\nс флагом "Общий файл" (sharedfile), файл будет только дерегистрирован\nдеинсталлятором, когда связывающий счетчик достигнет нуля.\n\nВ режиме установки 64-бит, работающей на версии Windows x 64,\nбиблиотека типа будет зарегистрирован внутри процесса 64-бит.\nЭто можно изменить, указав флаг 32-бит.\n\nРегистрация библиотеки типов в режиме 64-бит на версии\nWindows Itanium не поддерживается.
files_replacesameversion=Заменять равную версию.\n\nКогда используется этот флаг и файл уже существует на компьютере\nпользователя и имеет ту же версию, что и устанавливаемый файл,\nинсталлятор сравнит файлы и заменит существующий файл,\nесли их содержание различается.\n\nЕсли этот флаг не используется, существующий файл\nс тем же номером версии не заменяется.
files_restartreplace=Заменить при перезагрузке.\n\nЭтот флаг необходим при перемещении системных файлов ядра.\nЕсли файл существовал ранее и оказался заблокирован инсталлятором\nиз-за невозможности его переместить, инсталлятор зарегистрирует файл\n(в WININIT.INI или используя MoveFileEx для Windows и Windows NT\nсоответственно), чтобы переместить его после перезагрузки системы.\nКогда это произойдет, пользователю будет предложено перезагрузить\nкомпьютер в конце установки.\n\nДля сохранения совместимости с Windows 95/98/Me длинные имена файлов\nне могут использоваться с этим флагом. Поддерживаются только имена "8.3"\n(в Windows NT платформах этих ограничений нет).\n\nВАЖНО: Флаг restartreplace успешно переместит используемый файл на\nплатформах Windows NT, если пользователь наделен правами администратора.\nЕсли у пользователя нет прав администратора, появится сообщение:\n"RestartReplace невозможно: MoveFileEx невозможно; код 5". Поэтому при\nиспользовании restartreplace настоятельно рекомендуется установить\nPrivilegesRequired=admin в секции [Setup].
files_setntfscompression=Включить NTFS-сжатие для файла.\n\nУказывает инсталлятору включить NTFS-сжатие для файла\n (даже если файл не заменялся). Если по какой-либо причине\nвыключить сжатие невозможно (например, если сжатие не поддерживается\nфайловой системой), то никаких сообщений об ошибке показано не будет.
files_sharedfile=Общий файл.\n\nМногие файлы, установленные в директорию Windows System, должны использовать\nэтот флаг - это относится и к файлам .OCX, .BPL, и .DPL (Delphi 3 package).\nСведения об общих файлах (находятся в реестре в разделе\nHKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows\CurrentVersion\SharedDLLs).\n\nФлаг разрешает общее использование файла несколькими приложениями без боязни,\nчто они нечаянно удалятся. Каждый раз, когда файл устанавливается, для файла\nувеличивается связывающий счетчик. Когда приложение, использующее файл,\nудаляется, счетчик уменьшается. Если счетчик достигнет нулевого значения,\nфайл удалится (с разрешения пользователя).
files_skipifsourcedoesntexist=Пропустить, если нет источника.\n\nЭтот флаг указывает компилятору - или инсталлятору, если при этом\nиспользуется флаг "Внешний" (external) - без сообщений пропустить\nпараметр, если файл не существует, а не выдавать сообщение об ошибке.
files_solidbreak=Прерывать поток\n\nЕсли включено непрерывное сжатие, этот флаг указывает\nкомпиляторузавершить текущий поток сжатия и начинать\nновый перед сжатием файла(ов) источника. Это позволяет\nинсталлятору быстро найти файл, не разархивируя внчале\nвсе остальные файлы перед ним. Может быть полезно в\nбольшом, многокомпонентном инсталляторе, если вы\nсчитаете, что на декомпрессию файлов не выбранных\nкомпонент тратится слишком много времени.
files_sortfilesbyextension=Сортировать по расширению.\n\nЭтот флаг указывает компилятору перед сжатием файлов\nотсортировать их сначала по расширению а затем по имени пути.\nЭто уменьшит размер инсталлятора, если используется\nдиректива "Непрерывное сжатие" (SolidCompression).
files_sortfilesbyname=Сортировать по имени пути.\n\nЭтот флаг указывает компилятору перед сжатием файлов\nотсортировать их по имени пути. Это уменьшит размер инсталлятора,\nесли используется директива "Непрерывное сжатие" (SolidCompression).\nЕсли используется также "Сортировать по расширению"\n(sortfilesbyextension), файлы сначала сортируются по расширению.
files_touch=Время вручную.\n\nЭтот флаг указывает инсталлятору ставить ту отметку даты/времени\nустанавливаемых файлов, которая прописана в директивах\n"Установить дату" (TouchDate) и "Установить время" (TouchTime) секции [Setup].\n\nЭтот флаг не действует в комбинации с флагом "Внешний" (external).
files_uninsnosharedfileprompt=Не спрашивать, если общий.\n\nУказывает деинсталлятору автоматически, без запроса пользователю,\nудалить общий файл если счетчик ссылок на него равен нулю.\nДействует только совместно с флагом "Общий файл" (sharedfile).
files_uninsremovereadonly=Удалить "только для чтения".\n\nПри удалении файла убираются все атрибуты \n"только для чтения" перед попыткой удаления.
files_uninsrestartdelete=Удалить при перезагрузке.\n\nКогда используется этот флаг и при удалении файл используется, деинсталлятор\nпоставит файл на удаление после перезагрузки и в конце деинсталляции\nпредложит пользователю перезагрузить компьютер. Этот флаг может быть\nполезен, если потребуется удалить, например, программные оболочки,\nкоторые не могут быть остановлены программными средствами.\nОбратите внимание, что для действия этого флага в Windows NT/2000/XP\nнеобходимы права администратора.
files_uninsneveruninstall=Не деинсталлировать.\n\nНикогда не удалять данный файл. Этот флаг нужно использовать осторожно.\nОбычно он используется совместно с флагом "Только если не существует"\n(onlyifdoesntexist).Его можно использовать при установке файла,\nпредназначенного для общего использования, как, например, MFC DLL,\nпотому что в этом случае деинсталлятор не должен его удалять до тех пор,\nпока его используют другие приложения.
files_unsetntfscompression=Отключить NTFS-сжатие для файла.\n\nУказывает инсталлятору отключить NTFS-сжатие для файла\n(даже если файл не заменялся). Если по какой-либо причине выключить\nсжатие невозможно (например, если сжатие не поддерживается файловой\n системой), то никаких сообщений об ошибке показано не будет.
icons_closeonexit=Закрывать при выходе.\n\nЕсли этот флаг установлен, инсталлятор задаст ярлыку свойство\n"Закрыть при выходе" ("Close on Exit"). Этот флаг будет работать\nтолько если ярлык указывает на приложение MS-DOS (если оно\nимеет расширение .pif, которое является специфичным). Если при\nэтом не указан флаг "Не закрsdfnm при выходе" (dontcloseonexit),\nинсталлятор не будет изменять  свойство "Закрыть при выходе".
icons_createonlyiffileexists=Создать, если файл существует.\n\nЕсли этот флаг установлен, инсталлятор создаст ярлык только,\nесли файл указанный в параметре "Имя файла" (Filename) существует.
icons_dontcloseonexit=Не закрывать при выходе.\n\nПохож на флаг closeonexit, только отменяет в\nинсталляторе проверку свойства "Закрыть при выходе".
icons_excludefromshowinnewinstall=Не показывать в новой установке.\n\nПредотвращает запись Меню "Пуск" для недавно\nустановленного ярлыка приложения от получения\nвыделения на Windows 7 (или позже). Игнорируется\nна более ранних версиях Windows.
icons_foldershortcut=Ярлык к папке.\n\nСоздает специальный ярлык - ярлык папки ("Folder Shortcut").\nОбычно, если ярлык находится в меню Пуск, щелчок на нем\nоткрывает содержимое всей папки в новом окне. Ярлык папки\nпредставляет собой обычную папку, которая будет содержать\nфайлы одной (данной) папки.\n\nЯрлыки папок поддерживаются в Windows Me, 2000 и позднее.\nВ более ранних версиях Windows при этом флаге будет\nсоздан обычный ярлык.\n\nВ настоящее время данный флаг игнорируется при работе на\nWindows 7 (или более поздней версии), так как папка ярлыков\nбольше не развертывается в меню "Пуск". Не известно,\nявляется ли это ошибкой в Windows 7 или удалена функция.\n\nПри использовании этого флага в параметре Filename\nдолжно быть указано имя папки, а не файла. В противном\nслучае будет создан неработающий ярлык.
icons_runmaximized=Выполнять развернутым.\n\nКогда этот флаг установлен, инсталлятор устанавливает\nсвойство окна в "Развернутое на весь экран", так что окно\nпрограммы будет развернуто при старте установки.
icons_runminimized=Выполнять свернутым.\n\nКогда этот флаг установлен, инсталлятор устанавливает\nсвойство окна в "Свернутое в значок", так что окно\nпрограммы будет свернуто при старте установки.
icons_uninsneveruninstall=Не деинсталлировать.\n\nЗапрещает деинсталлятору удалять этот ярлык.
icons_useapppaths=Использовать "App paths".\n\nКогда этот флаг установлен, указывается только имя (без пути) в\nпараметре "Имя файла" (Filename) , и инсталлятор найдет путь в\n"HKEY_LOCAL_MACHINESOFTWAREMicrosoftWindowsCurrentVersionApp Paths"\nключ реестра и присоединит его к имени файла автоматически.
ini_createkeyifdoesntexist=Создать ключ только если не существует.\n\nЗаписывать значение в ключ только если имя ключа не существует.\nЕсли этот флаг не задан, то ключ будет установлен независимо\nот того, существовал ли он уже.
ini_uninsdeleteentry=Удалять параметр при деинсталляции.\n\nУдалять параметр при деинсталляции программы.\nМожет комбинироваться с флагом "Удалять секцию при\nдеинсталляции, если пустая" (uninsdeletesectionifempty).
ini_uninsdeletesection=Удалять секцию при деинсталляции.\n\nПри деинсталляции программы удалить секцию с параметром,\nв котором он находится. Не рекомендуется использовать этот\nфлаг для секции, которой пользуется Windows\n(например, некоторые секции в WIN.INI). Следует использовать\nэтот флаг только в секциях самого вашего приложения.
ini_uninsdeletesectionifempty=Удалять секцию при деинсталляции, если пустая.\n\nПохоже на "Удалять секцию при деинсталляции" (uninsdeletesection),\n но удаляет секцию, только если она не содержит никаких ключей.\n Может использоваться совместно с флагом "Удалять вхождение\n при деинсталляции" (uninsdeleteentry).
registry_createvalueifdoesntexist=Создать значение только если не существует.\n\nКогда установлен этот флаг, инсталлятор создаст параметр, но\nтолько в том случае, когда параметр с таким именем не уществует.\nЭтот флаг не действует, если тип данных none или задан флаг\n"Удалить значение при деинсталляции" (deletevalue).
registry_deletekey=Удалить ключ перед инсталляцией.\n\nКогда установлен этот флаг, инсталлятор сначала попытается удалить\nключ, если он существует, со всеми его параметрами и разделами.\nЕсли ValueType=none, после этого он создаст новый ключ и параметр.\n\nДля предотвращения негативных последствий, этот флаг игнорируется\nпри установке, если Subkey пустой или состоит только из бэкслешей.
registry_deletevalue=Удалить значение при деинсталляции.\n\nКогда установлен этот флаг, инсталлятор сначала попытается\nудалить параметр, если он существует. Если параметр ValueType\nне равен none, после этого он создаст ключ, если он\nне существует, и новый параметр.
registry_dontcreatekey=Не создавать ключ.\n\nКогда установлен этот флаг, инсталлятор не будет пытаться\nсоздать ключ или любой параметр, если ключ уже не существует\nв системе пользователя. Инсталлятор не выдаст сообщений об\nошибке, если ключ не существует.\nОбычно этот флаг используется в комбинации с флагом\n"Удалить ключ при деинсталляции" (uninsdeletekey) для\nудаления ключей во время установки, но не создания\nих в течение установки.
registry_noerror=Игнорировать ошибки.\n\nНе отображать сообщение об ошибке, если инсталлятор не\nсможет по какой-либо причине создать ключ или параметр.
registry_preservestringtype=Сохранить строковый тип.\n\nЭтот флаг применим только если "Тип" (ValueType) имеет значение\n"string" или "expandsz". Когда установлен этот флаг и параметр\nеще не существует или существующий параметр не строковый тип\n(REG_SZ или REG_EXPAND_SZ), параметр будет создан и ему\nприсвоится значение, указанное в "Тип" (ValueType).\nЕсли параметр существовал и имел тип string, он будет заменен\nпараметром с тем же типом, что и существовавший ранее.
registry_uninsclearvalue=Очистить значение при деинсталляции.\n\nПрисвоить этому значению при деинсталляции программы пустую строку\n(REG_SZ). Этот флаг не может использоваться совместно с флагом\n"Удалить ключ при деинсталляции" (uninsdeletekey).
registry_uninsdeletekey=Удалить при деинсталляции.\n\nУдалить при деинсталляции программы ключ, включая все значения\nи подключи этого ключа. Недопустимо устанавливать этот флаг для\nключей используемых самой Windows. Следует использовать этот\nфлаг только в ключах самого вашего приложения.\n\nЭтот флаг игнорируется при установке, если "Подключ" (Subkey)\nне определен или содержит только бэкслеши (символ ).
registry_uninsdeletekeyifempty=Удалить ключ при деинсталляции если пустой.\n\nУдалить при деинсталляции ключ, если он не содержит никаких значений\nили подключей. Этот флаг не комбинируется с флагом\n"Удалить значение при деинсталляции" (uninsdeletevalue).\n\nЭтот флаг игнорируется при деинсталляции если "Подключ" (Subkey)\nне определен или содержит только бэкслеши (символ ).
registry_uninsdeletevalue=Удалить значение при деинсталляции\n\nУдалить параметр при удалении программыю Этот флаг может\nкомбинироваться с флагом uninsdeletekeyifempty.\n\nВнимание: В Inno Setup до версии 1.1 можно использовать этот\nфлаг с типом none и без функции, как то флаг "Удалить ключ,\nесли он пустой". Этот метод больше не поддерживается. Теперь\nнеобходимо использовать флаг uninsdeletekeyifempty для этого.
run_32bit=32-бит.\n\nУстанавливает для константы {sys} значение 32-битного\nсистемного каталога при использовании параметров\n"Имя файла" (Filename) и "Рабочий каталог" (WorkingDir).\nЭто значение по умолчанию при установке в 32-битном режиме.\n\nЭтот флаг не может быть объединен с флагом\n"Исполняется оболочкой" (shellexec).
run_64bit=64-бит.\n\nУстанавливает для константы {sys} значение 64-битного\nсистемного каталога при использовании параметров\n"Имя файла" (Filename) и "Рабочий каталог" (WorkingDir).\nЭто значение по умолчанию при установке в 64-битном режиме.\n\nЭтот флаг может использоваться только в тех случаях, когда\nинсталлятор выполняется на 64-битной версии Windows, иначе\nпроизойдет ошибка. В инсталляторе, поддерживающего как 32-\nтак и 64-битные архитектуры можно избежать этой ошибки путем\nдобавления проверки: параметр IsWin64, который автоматически\nпропустит вхождение при запуске в 32-битной версии Windows.\n\nЭтот флаг не может быть объединен с флагом\n"Исполняется оболочкой" (shellexec).
run_hidewizard=Скрыть Мастера.\n\nЕсли этот флаг установлен, Мастер будет скрыт\nна время выполнения программы.
run_nowait=Не ждать.\n\nЕсли указан этот флаг, инсталлятор не будет ждать завершения\nработы выполняемой программы, чтобы перейти к следующему\nпараметру секции "Выполнить" [Run] или завершить установку.\n\nНе комбинируется с флагом  "Дождаться остановки" (waituntilidle).
run_postinstall=После установки.\n\nДействителен только в секции [Run]. Указывает инсталлятору\nсоздать задание с флажком (checkbox) на странице Мастера\n"Установка завершена". Пользователь может выбрать из\nпредложенного списка параметры, которые он хочет запустить\nили отменить. Раньше этот флаг назывался showcheckbox.\n\nЕсли инсталлятор должен перезагрузить компьютер пользователя\n(после установки файла с флагом restartreplace или если в\nсекции [Setup] директива AlwaysRestart=yes), страница с\nфлажком для выбора не сможет отобразиться и из-за этого\nпараметр не запустится.\n\nФлаг isreadme для параметров секции [Files] теперь не нужен.\nЕсли компилятор обнаружит флаг isreadme, он его удалит и\nзаменит соответствующим заданием секции [Run] в начале\nэтой секции. У этого задания будут флаги shellexec,\nskipifdoesntexist, postinstall и skipifsilent.
run_runascurrentuser=Текущие права пользователя.\n\nЕсли этот флаг установлен, порожденные процессы наследуют пользовательские\n права инсталлятора/деинсталлятора (обычно, полные права администратора).\n\nЭто обычная ситуация, если не установлен флаг "После установки" (postinstall).\n\nНе может использоваться совместно с флагом "Оригинальные права пользователя"\n (runasoriginaluser).
run_runasoriginaluser=Оригинальные права пользователя.\n\nДействует только в секции "Выполнить" [Run]. Если этот флаг установлен и\nоперационная система Windows Vista или более позняя, порожденный процесс\nбудет выполняться с правами пользователя, который запустил Мастер установки\nизначально.\n\nЭто обычная практика, если установлен флаг "После установки" (postinstall).\n\nЕсли пользователь начинает установку, щелкая правой кнопкой мыши по ее\nEXE-файлу и выбирая "Запуск от имени администратора", то этот флаг не\nбудет иметь эффекта, потому что инсталлятор не сможет выполнить код с\nоригинальными правами пользователя. То же самое истинно, если установка\nначата из уже запущенного процесса. Однако, это не ограничение Inno Setup;\nИнсталляторы на основе Windows Installer также не могут в этом случае\nвозвратиться к оригинальным правам пользователя.\n\nНе может использоваться совместно с флагом "Текущие права пользователя"\n(runascurrentuser).
run_runhidden=Выполнить скрытно.\n\nЕсли установлен этот флаг, программа запустится в скрытом окне.\nНикогда не используйте этот флаг для программы, которой\nпотребуется, чтобы пользователь ввел какие-либо данные.
run_runmaximized=Выполнить развернутым.\n\nЕсли этот флаг установлен, то программа запустится\nразвернутой на весь экран.
run_runminimized=Выполнить свернутым.\n\nЕсли этот флаг установлен, то программа или документ\nбудут запущены в свернутом виде.
run_shellexec=Исполняется оболочкой.\n\nЭтот флаг можно использовать только если в "Имя файла" (Filename) задан\nне исполняемый файл (не .exe и не .com). Когда флаг установлен, "Имя файла"\n(Filename) может быть папкой или любым зарегистрированым типом файла -\nвключая .hlp, .doc и т.д. Файл будет отрыть программой по умолчанию для\nего типа. То же произойдет, если пользователь дважды кликнет мышью\nна файле в окне Проводника.\n\nПо умолчанию, при использовании флага "Исполняется оболочкой" (shellexec),\nинсталлятор не будет ждать, пока завершится запущенный процесс. Если\nнеобходимо, чтобы инсталлятор подождал завершения выполнения процесса, \nследует комбинировать флаг "Исполняется оболочкой" (shellexec)\nс флагом "Дождаться остановки" (waituntilterminated).\n\nОбратите внимание, что инсталлятор не будет ждать окончания процесса,\nесли, например, в "Имя файла" (Filename) указана папка.
run_skipifdoesntexist=Пропустить если файл не существует.\n\nЕсли этот флаг указан в секции "Выполнить" [Run], инсталлятор\n не выведет сообщение об ошибке, если "Имя файла" (Filename)\n не существует.\n\nЕсли этот флаг указан в секции "Выполнить при деинсталляции"\n [UninstallRun], деинсталлятор не выдаст предупреждения\n "Некоторые элементы не могут быть удалены", если "Имя файла"\n (Filename) не существует.\n\nКогда используется этот флаг, "Имя файла" (Filename) должно\n быть абсолютным путем.
run_skipifnotsilent=Пропустить, если не скрытно.\n\nДействует только в секции "Выполнить" [Run]. Указывает инсталлятору\nпропускать параметр при не (очень) ускореной установке ((very) silent).
run_skipifsilent=Пропустить если скрытно.\n\nДействует только в секции "Выполнить" [Run]. Указывает инсталлятору\nпропускать параметр при (очень) ускореной установке ((very) silent).
run_unchecked=Переключатель не выбран.\n\nДействует только в секции "Выполнить" [Run]. Указывает\nинсталлятору не ставить флажок в строке с параметром.\nПользователь может его выбрать, если захочет его запустить.\nЭтот флаг игнорируется, если также установлен флаг\n"После установки" (postinstall).
run_waituntilidle=Дождаться остановки.\n\nЕсли установлен этот флаг, инсталляция остановится и подождет, пока\nпользователь введет необходимые ей данные, вместо того, чтобы ожидать\nокончания процесса. (Как функция Win32 WaitForInputIdle).\nНе комбинируется с флагом "Не ждать" (nowait).
run_waituntilterminated=Ожидать завершения процесса.\n\nЕсли указан этот флаг, инсталлятор подождет, пока процесс полностью\nзавершится. Обратите внимание, что этот флаг всегда задается по\nумолчанию (т.е. для того, чтобы инсталлятор подождал, пока завершится\nпроцесс, этот флаг указывать не обязательно). Указывается он только\nв комбинации с флагом "Исполняется оболочкой" (shellexec) - в этом\nслучае это необходимо, если инсталлятор должен дождаться завершения\nпроцесса. Не комбинируется с флагами "Не ждать" (nowait) и\n"Дождаться остановки" (waituntilidle).
3rdparty_runminimized=Выполнять свернутым.\n\nЕсли этот флаг указан, он запустит программу или документ\nв свернутом окне.
3rdparty_abortonerror=Прерывать при ошибке.\n\nЕсли этот флаг указан, компиляция будет прервана при\nобнаружении ошибки.
3rdparty_cmdprompt=Если этот флаг указан, операция будет выполняться в командной\nстроке Windows.
3rdparty_redirectoutput=Перенаправление вывода.\n\nВесь вывод командной строки будет перенаправлен к полю\nсписка Compiler Output.\n\nПРЕДУПРЕЖДЕНИЕ! Это может замедлить скрипт, используйте\nтолько при необходимости.


[Directives]
AllowCancelDuringInstall=При значении "no" пользователь не сможет прервать запущенный\r\nпроцесс установки - кнопка "Cancel" будет недоступна, а клики\r\nпо кнопке "Close" будут игнорироваться. Тот же эффект\r\nдостигается вводом /NOCANCEL в командной строке инсталлятора.
AllowNoIcons=Используется, чтобы определить, должен ли инсталлятор показать\nпереключатель "Не создавать значков", который позволит пользователю\nпропустить создание ярлыков к программе. Если не выбрано, пеерключатель\nне будет показан;если выбрано - будет показан.
AllowRootDirectory=Если директива не выбрана (значение по умолчанию),\nпользователь не сможет выбрать корневой каталог (например "C:")\nна странице "Выбор папки установки" в инсталляторе.
AllowUNCPath=При значении 'no'. пользователю не будет разрешено\nвводить путь UNC (например "\\server\share") на\nстранице Выбора папки для установки.\n\nБыло принято по умолчанию в Inno Setup 2.0.17 и ранее.
AlwaysRestart=При значении "yes" инсталлятор будет всегда предлагать перезагрузить\r\nкомпьютер после успешной установки, даже если это не нужно\r\n(в секции [Files] могут быть параметры с флагом "restartreplace").
AlwaysShowComponentsList=Если эта директива установлена, инсталлятор всегда будет предлагать\nвыбрать устанавливаемые компоненты из списка. Если эта директива\nне установлена, то инсталлятор покажет список компонентов для выбора\nтолько если пользователь выбрал установку из списка типов установок.
AlwaysShowDirOnReadyPage=Если эта директива установлена, инсталлятор всегда будет показывать\nвыбранный каталог в списке выбранных параметров на странице\n"Всё готово к установке". Если директива не установлена, инсталлятор\nне будет показывать выбранный каталог, если установлена директива\n"Отключить страницу "Выбор папки установки"" (DisableDirPage).
AlwaysShowGroupOnReadyPage=При значении "yes", инсталлятор всегда будет отображать\r\nпрограммную группу меню "Пуск" на странице мастера\r\n"Всё готово к установке".\r\n\r\nПри значении "no", имя группы не отобразится если\r\nDisableProgramGroupPage=yes.\r\n\r\nЕсли при установке программная группа не создана,\r\nэта директива игнорируется.
AlwaysUsePersonalGroup=Обычно на платформах Windows NT, константа Inno Setup {group}\nуказывает на меню "Пуск" для категории "All Users", если пользователь\nимеет права администратора. Если эта директива установлена, то всегда\nбудет использоваться профиль текущего пользователя.
AppComments=Эти директивы используются для определения содержимого вкладки\r\n"Поддержка" диалога "Установка и удаление программ" на Панели\r\nуправления в Windows 2000/XP. Эти опции не работают на более\r\nранних версиях Windows. Значения могут содержать константы.
AppContact=Эти директивы используются для определения содержимого вкладки\r\n"Поддержка" диалога "Установка и удаление программ" на Панели\r\nуправления в Windows 2000/XP. Эти опции не работают на более\r\nранних версиях Windows. Значения могут содержать константы.
AppCopyright=Эта не обязательная директива об авторских правах в правом\r\nнижнем углу инсталлятора. Директива будет работать\r\nтолько при WindowVisible=yes.\r\n\r\nЗначение директивы используется как значения по умолчанию\r\nдля VersionInfoDescription, если она не указана.
AppendDefaultDirName=По умолчанию при указании пути на странице "Выбор папки назначения" с\r\nпомощью кнопки "Обзор", инсталлятор автоматически добавляет в конце\r\nпапку с именем, указанном в директиве DefaultDirName.
AppendDefaultGroupName=По умолчанию при указании пути на странице "Выбор папки" меню "Пуск"\r\nс помощью кнопки "Обзор" инсталлятор автоматически добавляет в конце\r\nпапку с именем, указанном в директиве DefaultGroupName.\r\n\r\nЕсли значение директивы "no", папка в конце указанного пользователем\r\nпути создаваться не будет. На странице выбора появится\r\nкнопка "Создать папку".
AppId=Значение директивы AppId записывается в файл настройки деинсталлятора\r\n(unins???.dat), и если до начала данной установки, файл уже существовал,\r\nсравниваются значения, записанные там.\r\n\r\nЕсли эти значения (AppId) совпадают, файл настройки дополняется,\r\nиначе создается новый файл настройки под другим именем.\r\n\r\nНапример, у вас есть два инсталлятора - один под названием "My Program",\r\nа другой - "My Program 1.1 Обновление". Чтобы при инсталляции второй\r\nпрограммы-обновления файл настройки My Program дополнялся, установите\r\nв обоих инсталляторах значение директивы AppId одинаковым.
AppModifyPath=Если эта директива определена, в апплете "Установка и удаление программ"\nПанели управления в Windows 2000/XP будет показана отдельная кнопка\n"Изменить". Это необязательный параметр, который игнорируется в более\nранних версиях Windows. Значение может включать константы.
AppMutex=Эта директива используется для предотвращения установки новой версии\r\nпрограммы, если она в данный момент выполняется, и удаления\r\nзапущенного приложения. При указании имен одного и более ограничителей\r\n(множественные ограничители разделяются запятыми) они будут проверяться\r\nинсталлятором и деинсталлятором.\r\n\r\nЕсли ограничители присутствуют, инсталлятор/деинсталлятор выдаст\r\nсообщение: "[Setup или Uninstall] обнаружил, что [AppName]\r\nвыполняется. Пожалуйста, завершите работу приложения, а потом\r\nнажмите ОК для продолжения или Отмена для выхода".\r\n\r\nЗначение может содержать константы.
AppName=Эта обязательная директива определяет название устанавливаемого\r\nприложения. Здесь не следует указывать номер версии - его\r\nуказывают в директиве AppVerName. При классическом стиле,\r\nтекст из AppName отображается в верхнем левом углу главного\r\nокна установки и окне мастера. Значение может содержать константы.\r\n\r\n\r\nЗначение этой директивы также используется как значения по\r\nумолчанию для VersionInfoDescription, если она не указана.
AppPublisher=Эти директивы используются для определения содержимого вкладки\r\n"Поддержка" диалога "Установка и удаление программ" на Панели\r\nуправления в Windows 2000/XP. Эти опции не работают на более\r\nранних версиях Windows. Значения могут содержать константы.\r\n\r\nЗначение директивы AppPublisher также используется как значение\r\nпо умолчанию для директивы VersionInfoCompany, если она не указана.
AppPublisherURL=Эти директивы используются для определения содержимого вкладки\r\n"Поддержка" диалога "Установка и удаление программ" на Панели\r\nуправления в Windows 2000/XP. Эти опции не работают на более\r\nранних версиях Windows. Значения могут содержать константы.
AppReadmeFile=Эти директивы используются для определения содержимого вкладки\r\n"Поддержка" диалога "Установка и удаление программ" на Панели\r\nуправления в Windows 2000/XP. Эти опции не работают на более\r\nранних версиях Windows. Значения могут содержать константы.
AppSupportPhone=Эти директивы используются для определения содержимого вкладки\r\n"Поддержка" диалога "Установка и удаление программ" на Панели\r\nуправления в Windows 2000/XP. Эти опции не работают на более\r\nранних версиях Windows. Значения могут содержать константы.
AppSupportURL=Эти директивы используются для определения содержимого вкладки\r\n"Поддержка" диалога "Установка и удаление программ" на Панели\r\nуправления в Windows 2000/XP. Эти опции не работают на более\r\nранних версиях Windows. Значения могут содержать константы.
AppUpdatesURL=Эти директивы используются для определения содержимого вкладки\r\n"Поддержка" диалога "Установка и удаление программ" на Панели\r\nуправления в Windows 2000/XP. Эти опции не работают на более\r\nранних версиях Windows. Значения могут содержать константы.
AppVerName=Значение этой обязательной директивы должно быть таким же\n(или подобным), что и значение AppName, но должно также включать\nномер версии программы. Значение может включать константы.
AppVersion=Эти директивы используются для определения содержимого вкладки\r\n"Поддержка" диалога "Установка и удаление программ" на Панели\r\nуправления в Windows 2000/XP. Эти опции не работают на более\r\nранних версиях Windows. Значения могут содержать константы.\n\nЭто используется для задания значения MajorVersion и\nMinorVersion при возможности в "Удалить ключ реестра".
ArchitecturesAllowed=Указывает, какая установка с архитектурой процессора может выполняться.\nЕсли эта директива не указана или пустая, программе установки будет разрешено\nработать на всех архитектурах процессора, способной выполнять его 32-битный\nкод (в том числе те, которые не распознает).\n\nИначе, если архитектура процессора пользователя не указана в этой директиве,\nпрограмма установки выведет сообщение об ошибке и сделает выход.
ArchitecturesInstallIn64BitMode=Определяет архитектуры 64-битных процессоров для которых установка должна производиться в 64-битном режиме (например: x64 ia64). Если ни чего не указано, инсталлятор запускается в 32-битном режиме.\r\n\r\nИзменять значение этой директивы есть смысл, только если Ваш инсталлятор содержит 64-разрядные исполнимые файлы или библиотеки.
BackColor=Директива BackColor определяет цвет, используемый на верхнем\r\n(или левом, если BackColorDirection=lefttoright) градиентном\r\nфоне окна инсталлятора. BackColor2 определяет цвет,\r\nиспользуемый внизу (или справа).\r\n\r\nПараметр BackColor2 игнорируется, если BackSolid=yes.
BackColor2=Директива BackColor определяет цвет, используемый на верхнем\r\n(или левом, если BackColorDirection=lefttoright) градиентном\r\nфоне окна инсталлятора. BackColor2 определяет цвет,\r\nиспользуемый внизу (или справа).\r\n\r\nПараметр BackColor2 игнорируется, если BackSolid=yes.
BackColorDirection=Определяет направление градиентного фона окна инсталлятора.\r\nПри значении "toptobottom" оно направлено сверху вниз, при\r\nзначении "lefttoright" - с лева на право.
BackSolid=Определяет, использовать ли монотонный или градиентный цвет\nв фоновом окне Мастера. Если выбрано, фон монотонный\n(используется цвет, указанный в "Цвет 1" (BackColor);\n"Цвет 2" (BackColor2) игнорируется).
ChangesAssociations=При значении "yes" после завершения установки файлы в Проводнике\r\nбудут ассоциироваться с установленной программой, деинсталлятор\r\nвернет прежние ассоциации при удалении программы.\r\n\r\nЕсли инсталлятор меняет ассоциации файлов (в реестре), но не\r\nимеет ChangesAssociations=yes, правильный значок, программа\r\nпо умолчанию и прочие изменения в контекстных меню не\r\nобновятся до перезагрузки ПК.
ChangesEnvironment=При значении "yes" в конце установки инсталлятор сообщит другим\r\nзапущенным приложениям (в частности Проводнику), чтобы они\r\nперезагрузили переменные среды из реестра.\r\n\r\nНа NT-платформах Windows, если инсталлятор создает или изменяет\r\nпеременную среды, а ChangesEnvironment не присвоено значение "yes",\r\nновая/обновленная переменная среды не будет доступна для приложений,\r\nзапущенных из Проводника, пока пользователь не завершит сеанс или\r\nне перезагрузит компьютер.
CompileLogFile=
CompileLogMethod=
Compression=Определяет метод и уровень (1-9) сжатия инсталлятора. Чем выше\r\nуровень сжатия, тем медленнее будет создаваться инсталлятор.\r\nК тому же может понадобиться больше памяти на сжатие/декомпрессию.
CompressionLevel=Какой уровень сжатия использовать.
CompressionThreads=Определяет, включен ли режим многопоточного сжатия LZMA.\r\nМногопоточность может ускорить процесс сжатия\r\nна 50% или более в системах с несколькими ядрами и 20%\r\nили более на системах с одноядерными процессорами Intel,\r\nобладающими технологией Hyper-Threading.
CreateAppDir=Если директива не выбрана, каталог для приложения не будет создан,\nстраница "Выбор папки установки" в инсталляторе не будет показана,\nи константа каталогов {app} будет эквивалентна константе каталогов {win}.Если особенности деинсталляции позволяют не устанавливать директиву\n\n"Создавать каталог приложения" (CreateAppDir), то файлы данных для\nдеинсталляции будут созданы в системном каталоге Windows.
CreateUninstallRegKey=При значении "no" инсталлятор не будет создавать пункта программы в\r\nдиалоге "Установка и удаление программ". Это может быть полезно,\r\nесли программа является обновлением для установленного приложения\r\nи запись в этом диалоге не нужна, но надо сохранить возможность\r\nудаления обновления (Uninstallable=no).\r\n\r\nКогда эта директива имеет значение "no", UpdateUninstallLogAppName\r\nустанавливается обычно в "no".
DefaultDirName=Эта обязательная директива определяет папку, в которую инсталлятор\r\nпредложит установить программу. Обычно она начинается с константы.\r\n\r\nЕсли UsePreviousAppDir=yes (по умолчанию) и предыдущая версия\r\nпрограммы установлена, то новая версия этого приложения будет\r\nустановлена в ту же папку, что и старая. Инсталлятор ищет\r\nпредыдущую установку по директиве AppId, и если она не указана,\r\nпо директиве AppName.
DefaultGroupName=Директива определяет имя группы меню "Пуск" по умолчанию, которое\r\nиспользуется на странице Выбор программной группы мастера. Если\r\nзначение директивы не указано или пустое, будет использовано\r\nзначение по умолчанию "(Default)".\r\n\r\nИмейте в виду, что для групп меню "Пуск" действуют правила имен\r\nпапок, отличные от правил для обычных папок.
DefaultUserInfoName=Определяет имя по умолчанию, показываемое на странице\n"Информация о пользователе" Мастера. Может включать константы.
DefaultUserInfoOrg=Определяет организацию по умолчанию, показываемую на странице\n"Информация о пользователе" Мастера. Может включать константы.
DefaultUserInfoSerial=Определяет серийный номер по умолчанию, показываемый на странице\n"информация о пользователе" Мастера. Может включать константы.
DirExistsWarning=Если установлена в "Авто" (значение по умолчанию), инсталлятор выведет\nсообщение " Папка ... уже существует. Всё равно установить в эту папку?",\nесли пользователь выбирает уже существующий каталог на странице\n"Выбор папки установки" в инсталляторе, кроме случаев, когда установлена\nдругая версия того же самого приложения, и выбранный каталог использовался\nв предыдущей установке (только если выбрана директива "Использовать каталог\nпредыдущей установки" (UsePreviousAppDir) (значение по умолчанию).\n\nЕсли выбрано "Да" (yes), инсталлятор будет всегда выводить сообщение\n"Папка ... уже существует. Всё равно установить в эту папку?",\nкогда пользователь выбирает существующий каталог\n\nЕсли выбрано "Нет" (no), инсталлятор никогда не\nбудет выводить сообщение " Папка существует".
DisableDirPage=Если выбрано, инсталлятор не будет показывать страницу\n"Выбор папки установки". В этом случае, всегда будет\nиспользоваться каталог по умолчанию.
DisableFinishedPage=При значении "yes" инсталлятор не будет отображать страницу\r\n"Установка завершена" и сразу завершит свою работу. Это может быть\r\nполезно в случае, когда сразу после установки запускаются файлы из\r\nсекции [Run] с флагом "nowait" - страница "Установка завершена" не\r\nпоявится вслед за уже запущенными файлами.\r\n\r\nОбратите внимание, что директива DisableFinishedPage игнорируется,\r\nесли требуется перезагрузить компьютер или есть файл в InfoAfterFile\r\nсекции [Setup]. В этих случаях страница "Установка завершена" все\r\nравно будет отображена.
DisableProgramGroupPage=Если эта директива установлена, инсталлятор не будет показывать\nстраницу "Выберите папку в меню "Пуск"". В этом случае будет\nиспользовано имя папки, указанное директивой\n"Имя группы по умолчанию" (DefaultGroupName) из секции\n[Setup], или "(Default)" если эта директива не определена.
DisableReadyMemo=Если установлено, инсталлятор не будет показывать список\nвыбранных параметров на странице "Всё готово к установке".\nИначе список показывается и содержит информацию о\nвыбранном типе установки и выбранных компонентах.
DisableReadyPage=Если установлено, инсталлятор не будет показывать\nстраницу "Всё готово к установке".
DisableStartupPrompt=При значении "yes", инсталлятор не будет отображать сообщение\r\n"Эта программа установит… Продолжить?".\r\n\r\nИгнорируется, если UseSetupLdr имеет значение "no".
DisableWelcomePage=Если установлено, инсталлятор не будет показывать страницу "Добро пожаловать".
DiskClusterSize=Определяет размер кластера дисковых носителей.\r\n\r\nКомпилятор должен знать это, чтобы правильно заполнить каждый\r\nдиск до отказа.\r\n\r\nДиректива игнорируется, если разбиение на диски не включено\r\nс помощью директивы DiskSpanning в секции [Setup].
DiskSliceSize=Определяет максимальное количество байт в дисковом разделе\r\n(SETUP-*.BIN-файл).\r\n\r\nКак правило, это должно быть установлено в общее количество\r\nбайт, доступных на дисковых носителях, разделенных на значение\r\nдирективы SlicesPerDisk секции [Setup], которое по умолчанию 1.\r\n\r\nДиректива игнорируется, если разбиение на диски не включено\r\nс помощью директивы DiskSpanning в секции [Setup].\r\n\r\nНачиная с Inno Setup 5.3.8, значение по умолчанию было изменено\r\nна 2100000000.
DiskSpanning=Выбор разрешает разбивку дистрибутива на тома.\n\nВместо сохранения всех данных дистрибутива внутри\nSETUP.EXE, компилятор разобьет их на несколько файлов\nSETUP-*.BIN - называемых "тома" - подходящих для\nкопирования на отдельные дискеты, CD-ROM или DVD-ROM.
EnableDirDoesntExistWarning=Если выбрано, инсталлятор выведет сообщение, если каталог выбранный\nпользователем не существует. В этом случае также обычно устанавливают\nдирективу "Предупреждать если каталог существует" в "Нет" (DirExistsWarning=no).
Encryption=Если отмечено, файлы, которые скомпилированы в дистрибутив\n(входящие в секцию "Файлы" [Files]), будут зашифрованы,\nиспользуя шифрование ARCFOUR со 128-ми битным ключом,\nполученным из значения директивы Password в секции [Setup].
ExtraDiskSpaceRequired=Обычно, требование к дисковому пространству, показываемое Мастером\nрассчитывается сложением размеров всех файлов в секции\n"Файлы и каталоги" [Files]. Если Вы хотите увеличить резервируемое дискового\nпространства по какой-либо причине, укажите в ExtraDiskSpaceRequired число\nбайтов, которое Вы желаете добавить к общей формуле.
FlatComponentsList=Если эта директива установлена, инсталлятор будет использовать\nплоские переключатели для списка компонентов. Иначе\nинсталлятор будет использовать трехмерные переключатели.
InfoAfterFile=Определяет имя файла в формате .txt или .rtf, который отображается\r\nпосле успешной установки. Этот файл должен быть расположен в\r\nисходной папке скрипта, если только для него не указан полный путь\r\nили нет приставки "compiler:" - в этом случае компилятор будет\r\nискать указанный файл в своем каталоге.\r\n\r\nОтличается от файлов с флагом "isreadme" тем, что отображается в окне\r\nинсталлятора, а не на странице Блокнота.\r\n\r\nЕсли пользователь выберет язык, для которого существует параметр\r\nInfoAfterFile, эта директива будет проигнорирована. Для справки\r\nобратитесь к описанию секции [Languages].
InfoBeforeFile=Определяет имя необязательного файла в формате .txt или .rtf,\nкоторый отображается перед выбором папки для установки. Этот\nфайл должен быть расположен в исходной папке скрипта, если\nтолько для него не указан полный путь или нет приставки\n"compiler:" - в этом случае компилятор будет искать\n указанный файл в своем каталоге.\n\nЕсли пользователь выберет язык, для которого существует\nпараметр InfoBeforeFile, эта директива будет проигнорирована.\nДля справки обратитесь к описанию секции [Languages].
InternalCompressLevel=Определяет уровень сжатия LZMA для использования в инсталляторе.\r\nКак правило, нет смысла его менять. Это параметр по умолчанию "normal".
LanguageDetectionMethod=При значении "uilanguage" инсталлятор будет использовать принятый\r\nпо умолчанию язык, который он определит по значению "UI language"\r\n(взяв значение в GetUserDefaultUILanguage(), либо, в версиях Windows,\r\nне поддерживающих эту функцию, взяв значение из реестра). Этот метод\r\nрекомендует Microsoft. "UI language" - язык, используемый в диалоговых\r\nокнах Windows. Так, в английских версиях Windows английский будет\r\nязыком по умолчанию, а в русских версиях - русский.\r\n\r\nПри значении "locale" инсталлятор будет использовать язык, указанный в\r\nGetUserDefaultLangID(). Эта функция возвращает значение "Your locale",\r\nзаданное в Панели управления - Язык и стандарты. Следует заметить, что\r\nв Windows 2000 и более поздних Windows опции "Your locale" не затрагивает\r\nязыки, имеются только "числа, валюта, время и даты".\r\n\r\nПри значении "none" инсталлятор будет использовать первый язык, указанный\r\nв секции [Languages] как язык по умолчанию.
LicenseFile=Имя файла с лицензией в формате .txt или .rtf, который отображается\r\nперед выбором папки . Этот файл должен быть расположен в исходной\r\nпапке скрипта, если только для него не указан полный путь или нет\r\nприставки "compiler:" - в этом случае компилятор будет искать\r\nуказанный файл в своем каталоге.\r\n\r\nЕсли пользователь выберет язык, для которого существует параметр\r\nLicenseFile, эта директива будет проигнорирована. Для справки\r\nобратитесь к описанию секции [Languages].
LZMAAlgorithm=Определяет алгоритм сжатия LZMA и LZMA2.\r\n\r\nЗначение 0 задает быстрый (fast) алгоритм.\r\nЗначение 1 задает нормальный (normal) алгоритм.
LZMABlockSize=Определяет размер блока сжатия LZMA2 в килобайтах, если LZMANumBlockThreads\r\nимеет значение 2 или выше.\r\n\r\nОбратите внимание, что слишком большое значение этого параметра может свести\r\nна нет преимущества многопоточности. Как правило, размер блока должен быть\r\nне более общего размера данных, разделенных на количество потоков.
LZMADictionarySize=Определяет размер словаря сжатия LZMA и LZMA2 в килобайтах.\r\nРазмер словаря может обеспечить лучший коэффициент сжатия\r\nза счет скорости сжатия и требования к памяти.\r\n\r\nПросмотрите требования к памяти в разделе "Сжатие" перед\r\nиспользованием.\r\nЕсли будет ошибка "Мало памяти" при очень большом размере\r\nсловаря, возможно, надо установить LZMAUseSeparateProcess.
LZMAMatchFinder=Определяет метод обнаружения соответствия сжатия LZMA и LZMA2.\r\n\r\nЗначение HC задает метод Hash Chain с 4 байтами хеша.\r\n\r\nЗначение BT задает метод Binary Tree с 4 байтами хеша.\r\n\r\nМетод Binary Tree может обеспечить лучший коэффициент сжатия за\r\nсчет скорости сжатия.
LZMANumBlockThreads=При сжатии большого объема данных у компрессора LZMA2 есть\r\nвозможность разделить данные на "блоки" и сжать два или\r\nбольше из этих блоков параллельно с помощью дополнительных\r\nпотоков (если достаточное питание процессора).\r\n\r\nЭта директива определяет количество потоков - то есть,\r\nмаксимальное количество блоков, которые компрессор LZMA2\r\nможет сжать параллельно.\r\n\r\nОЗНАКОМЬТЕСЬ С СПРАВОЧНОЙ ДОКУМЕНТАЦИЕЙ ПЕРЕД ИЗМЕНЕНИЕМ
LZMANumFastBytes=Определяет количество быстрых байт сжатия LZMA и LZMA2.\r\nБольшее количество быстрых байт может обеспечить лучшую\r\nстепень сжатия за счет скорость сжатия.
LZMAUseSeparateProcess=Определяет, выполняется ли сжатие LZMA в основном\r\nпроцессе компилятора или в отдельном процессе.\r\n\r\nОтдельный процесс для сжатия LZMA позволяет\r\nкомпрессору выделять большие объемы памяти, что\r\nпозволяет делать более высокие настройки в\r\nLZMADictionarySize и LZMANumBlockThreads.\r\nКроме того, на 64-битной Windows (x64), можно\r\nнаблюдать небольшое увеличение скорости сжатия.
MergeDuplicateFiles=Если есть два вхождения файлов указывающих на один исходный файл,\nобычно будет сжат и сохранен только один. Если у Вас есть несколько\nидентичных файлов в вашем дистрибутиве, заставьте их указывать на\nтот же самый исходный файл в сценарии, и размер вашего дистрибутива\nможет значительно уменьшиться.\n\nЕсли Вы по каким-либо причинам желаете отключить эту возможность,\nснимите галочку напротив опции.
MinVersion=Эта директива позволяет вам определять минимальную версию Windows,\nна которой может выполняться ваше программное обеспечение.
OnlyBelowVersion=Эта директива позволяет вам определять минимальную версию Windows NT,\nна которой ваше программное обеспечение не будет работать.
OutputBaseFilename=Эта директива позволяет вам назначить произвольное\nимя для файла(ов) дистрибутива , чтобы не пришлось\nпереименовывать его вручную после компиляции.
OutputDir=Определяет каталог вывода, в котором компилятор\nразместит скомпилированные файлы дистрибутива SETUP.*.\n\nПо умолчанию создается подкаталог "Output" в каталоге,\n содержащем компилируемый скрипт.
OutputManifestFile=Если эта директива установлена, компилятор создаст\nфайл описания, детализирующий информацию о файлах,\nскомпилированных в дистрибутив. Файл будет создан в\nкаталоге вывода, если указан другой путь.
Password=Пароль, который пользователь должен будет ввести в начале установки.\r\n\r\nИспользуя пароль, задайте директиве Encryption значение "yes", иначе\r\nфайлы сохранятся как простой текст и получить к ним доступ будет просто.\r\n\r\nСам пароль не хранится в виде открытого текста; он хранится как\r\n128-битный MD5 хеш, созданный на основе 64-битного случайного числа.\r\n(Если шифрование включено, то сохраненный хеш  не используется для\r\nшифрования ключа; другой хэш с другой основой генерируется для этого)
PrivilegesRequired=Вы можете указать минимальные привилегии, при которых будет разрешена\r\nустановка программы. При значении "poweruser" или "admin", инсталлятор\r\nвыдаст сообщение об ошибке (например:"Для установки этой программы\r\nтребуются права администратора"), если пользователь не имеет\r\nсоответствующих привилегий.\r\n\r\nРаботает только на платформах Windows NT.
ReserveBytes=Определяет минимальный размер пустого места на первом диске\r\nв байтах. Это может быть полезным, если понадобится на первый\r\nдиск скопировать файлы, не являющиеся файлами инсталлятора\r\n(например, файл ReadMe).\r\n\r\nКомпилятор округляет это число до кратности кластеру.\r\n\r\nДиректива игнорируется, если разбиение на диски не включено\r\nс помощью директивы DiskSpanning в секции [Setup].
RestartIfNeededByRun=При значении "yes" и если в секции [Run] имеются файлы, для запуска\r\nкоторых требуется перезагрузить компьютер (с помощью MoveFileEx или\r\nобновления wininit.ini), инсталлятор это обнаружит и в конце\r\nустановки перезагрузит компьютер пользователя.
SetupIconFile=Определяет новую иконку для программы-инсталлятора. Этот файл\r\nдолжен быть расположен в исходной папке скрипта, если только\r\nдля него не указан полный путь или нет приставки\r\n"compiler:" - в этом случае компилятор будет искать указанный\r\nфайл в своем каталоге.\r\n\r\nЭта директива не поддерживается в Windows 95/98/Me.
SetupLogging=Если установлено в "true", инсталлятор будет создавать\r\nлог-файл. Эквивалент /LOG в командной строке
ShowComponentSizes=При значении "yes" инсталлятор будет показывать размер компонентов в\r\nсписке компонентов. В зависимости от размера наибольшего из компонентов\r\nинсталлятор покажет размеры в КБ или МБ.
ShowLanguageDialog=Если установлено в "yes" и в секции "Языки" [Languages] записаны\nнесколько языков, будет показан диалог выбора языка инсталлятора,\nчтобы дать пользователю возможность изменить язык установленный\nпо умолчанию. Для получения более подробной информации\nсм. справку по секции "Языки" [Languages].\n\nЕсли установлено в "no", диалог никогда не будет показан.\n\nЕсли выбрано "auto", диалог будет показан только если инсталлятор\nне найдет язык с соответствующим идентификатором.
ShowTasksTreeLines=Если эта директива установлена, инсталлятор покажет\n"линии дерева"между родительскими задачами и подзадачами.
ShowUndisplayableLanguages=По умолчанию, языки, которые не могут быть отображены на\r\nсистеме пользователя из-за несоответствия кодовой страницы\r\nне перечислены в диалоге "Выбор языка". Например, русский\r\nтекст будет отображаться правильно при активной кодовой\r\nстранице 1251.\r\n\r\nЕсли у директивы значение "yes", все языки будут перечислены\r\nв диалоге "Выбор языка". Чтобы избежать недоразумений, это\r\nне рекомендуется включать в разработке инсталлятора.\r\n\r\nЭта директива игнорируется Unicode Inno Setup.
SignedUninstaller=Определяет, должен ли деинсталлятор (unins???.exe) быть развернут с\r\nцифровой подписью. Когда у деинсталлятора будет допустимая цифровая\r\nподпись, пользователи Windows Vista не будут видеть предупреждение\r\n"неопознанная программа" при запуске вне Панели управления.
SignedUninstallerDir=Задает каталог, в котором должны храниться подписанные файлы\r\nдеинсталлятора. По умолчанию такие файлы хранятся в выходном\r\nкаталоге. Отдельные скрипты могут совместно использовать один\r\nи тот же параметр SignedUninstallerDir.\r\n\r\nСоздав общий каталог для хранения подписанных файлов, вам\r\nне придется каждый раз заново подписывать деинсталлятор при\r\nкомпиляции файла скрипта с отличной установкой OutputDir.\r\nЕсли SignedUninstallerDir не полный путь, он будет\r\nрассматриваться как относительно SourceDir.\r\n\r\nУстановка "SignedUninstallerDir to ." приведет к файлам,\r\nпомещаемым в исходный каталог.
SignTool=Задает имя и параметры Sign Tool для цифровой подписи инсталлятора\r\n(и деинсталлятора, если SignedUninstaller=yes). Когда инсталлятор\r\nимеет цифровую подпись, пользователи не будут видеть предупреждение\r\nпри запуске "неопознанная программа".\r\n\r\nУказанное имя Sign Tool и его команда должны быть определены в\r\nкомпиляторе IDE или в командной строке компилятора, иначе\r\nпроизойдет ошибка.
SlicesPerDisk=Количество файлов SETUP-*.BIN, создаваемых на каждом диске.\n\nЕсли это значение равно 1 (значение по умолчанию), файлы будут\nназваны SETUP-X.BIN, где x - номер диска.\n\nЕсли это значение больше 1, файлы будут названы SETUP-XY.BIN,\nгде x - номер диска и y - уникальный символ.
SolidCompression=При значении "yes" включается уплотненное сжатие.\r\n\r\nРезультат такого сжатия будет лучше, особенно если\r\nинсталлятор содержит файлы одного типа и эти файлы\r\nсгруппированы в секции [Files].\r\n\r\nВ общем, уплотненное сжатие не рекомендуется применять\r\nк большим по размеру инсталляторам (скажем, больше 100 MB)\r\nили если используется разбиение на диски. Эта директива\r\nслужит для того, чтобы при скачивании из Internet\r\nмаленьких приложений экономилось время.
SourceDir=Определяет новый исходный каталог для скрипта.
TerminalServicesAware=Определяет, должен ли компилятор установить флаг "Готов к терминальной\r\nустановке" в заголовках инсталлятора и деинсталлятора. Эта функция новая\r\nдля версии 5.1.7 и значение по умолчанию "yes"; предыдущие версии никогда\r\nне ставили флаг.\r\n\r\nГлавное, флаг "Готов к терминальной установке" влияет на поведение константы\r\n{win} (и функции GetWinDir) на серверах с Терминальными службами,\r\nустановленными в режиме приложения.
TimeStampRounding=По умолчанию, время файлов, указанных в секции "Файлы и каталоги" [Files]\nокругляется до самой близкой 2-х секундной границы. Разделы с FAT имеют\nтолько 2-х секундную разрешающую способность по установке времени,\nтак что это гарантирует, что при операциях с файлами время будет\nустановлено одинаково на разделах и с FAT и с NTFS.\n\nОкругление может быть изменено или заблокировано установкой директивы\n"Округлять время" (TimeStampRounding). Установка её в 0 отключит округление.\nПри установке её между 1 и 60 время будет округляться до самой близкой\n "Округлять время" (TimeStampRounding) -секундной границы.
TimeStampsInUTC=По умолчанию временные отметки файлов, относящихся к секции [Files],\r\nсохраняются и отображаются как локальные. Это значит, что если\r\nотдельный файл имеет временную отметку 01:00 по локальному времени\r\nво время компиляции, инсталлятор установит файл с отметкой 01:00,\r\nигнорируя временную зону, в которой находится пользователь или\r\nпри действии DST.\r\n\r\nПри значении yes временные отметки будут сохранены и отображены в\r\nUTC - временном формате Win32 и NTFS. В этом режиме файл с временной\r\nотметкой 01:00 по локальному времени в Нью-Йорке получит временную\r\nотметку 06:00 по локальному времени в Лондоне.
TouchDate=Дата используется в отметке даты/времени для файлов, относящихся к\r\nсекции [Files] и имеющих флаг "touch".\r\n\r\nПри значении "current" дата равна системной дате (во время компиляции).\r\nПри значении "none" дата оставляется не тронутой.\r\n\r\nИначе TouchDate толкуется открыто в формате YYYY-MM-DD (ISO 8601).\r\nЕсли TimeStampsInUTC=yes, дата принимает значение UTC-даты.
TouchTime=Время используется в отметке время/дата для файлов, относящихся к\r\nсекции [Files] с флагом "touch".\r\n\r\nПри значении "current" время равно системному времени (во время\r\nкомпиляции). При значении "none" время остается не тронутым.\r\n\r\nИначе TouchTime толкуется открыто в формате HH:MM или HH:MM:SS.\r\nЕсли TimeStampsInUTC=yes время принимает значение UTC-времени.
Uninstallable=Inno Setup определяет, создавать ли автоматический деинсталлятор.\r\n\r\nПри значении "yes" или логического выражения для оценки "True" он\r\nсоздается. При значении "no" автоматическое удаление будет невозможно,\r\nтак что пользователь должен будет вручную удалять программу.\r\n\r\nУстановка этого значения в логическое выражение может быть полезным,\r\nесли вы хотите предложить пользователю опцию"портативный режим".
UninstallDisplayIcon=Определяет значок (.exe или .ico файл), который будет отображаться\r\nна странице "Установка и удаление программ" Панели управления\r\nWindows 2000/XP. Имя файла должно начинаться с константы,\r\nзадающей каталог.
UninstallDisplayIconIndex=Если вы указываете файл содержит несколько иконок, вы можете добавить\r\nокончание ",n", где n – индекс значка.\r\n\r\nЕсли эта директива не указана или пустая, Windows выберет значок сама,\r\nно он может быть не тот, который вы предпочитаете
UninstallDisplayName=Определяет название программы на странице "Установка и удаление программ"\r\nПанели управления. Значение может содержать константы. Если директива не\r\nуказана или пустая, инсталлятор использует значение директивы AppVerName\r\nсекции [Setup].\r\n\r\nИз-за ограничений на странице "Установка и удаление программ"\r\nПанели управления Windows 95/98/Me будет обрезано значение\r\nUninstallDisplayName, если оно превышает 63 символов.
UninstallDisplaySize=На Windows 7 и более новой версии инсталлятор использует эту\r\nдирективу для установки значения EstimatedSize в "Удалить  ключ\r\nреестра", когда это возможно, так как "Установка и удаление программ"\r\nПанели управления перестает автоматически вычисляет его.\r\n\r\nЕсли UninstallDisplaySize не задано, инсталлятор берет размер всех\r\nустановленных файлов и добавляет любые значения\r\nExtraDiskSpaceRequired.\r\n\r\nОбратите внимание: Windows 7 поддерживает отображение значений\r\nменьше, чем 4 ГБ.\r\n\r\nУстановка в байтах. (1048576 байт = 1 мегабайт)
UninstallFilesDir=Определяет папку, в которой будут содержаться файлы\r\nдеинсталлятора "unins*.*". \r\n\r\nОбратите внимание: здесь не следует задавать разные значения\r\nдля новой версии приложения, иначе инсталлятор не найдет файлы\r\nдеинсталлятора предыдущей версии и не сможет дополнить их.
UninstallLogMode="Добавить" (append) (значение по умолчанию), указывает инсталлятору\nдописывать в конец существующего журнала деинсталляции, если возможно.\n\n"Новый" (new), служит для совместимости с версиями Inno Setup меньше 1.3,\nуказывает инсталлятору всегда создать новый журнал деинсталляции.\n\n"Перезаписать" (overwrite) указывает Мастеру записывать журнал\nдеинсталляции поверх существующего для того же самого приложения,\nвместо дописывания в конец (не рекомендуется). Добавление к\nсуществующему журналу деинсталляции и перезапись существующего\nжурнала деинсталляции осуществляются по одинаковым правилам.
UninstallRestartComputer=При значении "yes" деинсталлятор всегда будет перезагружать компьютер\r\nпользователя после удачного удаления программы, даже если в этом нет\r\nнеобходимости (когда в секции [Files] присутствуют компоненты с\r\nфлагом uninsrestartdelete).
UpdateUninstallLogAppName=При значении "yes", когда существующий деинсталлятор дополняется,\r\nинсталлятор переместит поле AppName в записи с правильным AppName\r\nинсталлятора. Поле AppName деинсталлятора определяет заголовок\r\nдеинсталлятора. Если инсталлятор является обновлением или\r\nдополнением для уже установленной программы и вы не хотите,\r\nчтобы заголовок деинсталлятора изменился, задайте директиве\r\nзначение "no".
UsePreviousAppDir=При значении директивы "yes", в начале установки инсталлятор ищет в реестре,\r\nне была ли установлена данная программа на данном компьютере, и если так,\r\nто предложит установить программу в папку, которую выбрал пользователь в\r\nпрошлый раз при установке.\r\n\r\nК сведению, инсталлятор не может повторно использовать параметры\r\nиз предыдущей установки, если значение Uninstallable в "no", так как\r\nзаписи реестра не создаются при этом значении.
UsePreviousGroup=При значении директивы "yes", в начале установки инсталлятор ищет в\r\nреестре, не была ли установлена данная программа на данном компьютере,\r\nи если так, будет использовать ту же группу в меню "Пуск", которую\r\nвыбрал пользователь в прошлый раз при установке.\r\n\r\nКроме того, если AllowNoIcons имеет значение "yes", каких-либо иконки\r\nне создаются и будут восстановлены настройки из предыдущей установки.\r\n\r\nК сведению, инсталлятор не может повторно использовать параметры\r\nиз предыдущей установки, если значение Uninstallable в "no", так как\r\nзаписи реестра не создаются при этом значении.
UsePreviousLanguage=При значении "yes", в начале установки инсталлятор ищет в реестре,\r\nне была ли установлена данная программа на данном компьютере,\r\nи если так, будет использовать язык предыдущей установки, который\r\nвыбрал пользователь в прошлый раз при установке, как по умолчанию.\r\n\r\nОбратите внимание, что эта директива не изменяет язык самого\r\nдиалогового окна "Выбор языка", потому что текущий пользователь может\r\nне понимать те же языки, что и предыдущий пользователь. В разделе\r\n[Languages] смотри справку, на каком языке по умолчанию используется\r\nдиалоговое окно "Выбор языка".\r\n\r\nТакже к сведению, инсталлятор не может повторно использовать параметры\r\nиз предыдущей установки, если значение Uninstallable в "no", так как записи\r\nреестра не создаются при этом значении.\r\n\r\nUsePreviousLanguage=no, когда AppId включает константы.
UsePreviousSetupType=При значении директивы "yes", в начале установки инсталлятор ищет\r\nв реестре, не была ли установлена данная программа на данном компьютере,\r\nи если так, будет использовать тип и компоненты предыдущей установки,\r\nкоторые выбрал пользователь в прошлый раз при установке, как по умолчанию.\r\n\r\nК сведению, инсталлятор не может повторно использовать параметры\r\nиз предыдущей установки, если значение Uninstallable в "no", так как\r\nзаписи реестра не создаются при этом значении.
UsePreviousTasks=При значении "yes" в начале установки инсталлятор ищет в реестре,\r\nне была ли установлена данная программа на данном компьютере,\r\nи если так, будет использовать задачи предыдущей установки, которые\r\nвыбрал пользователь в прошлый раз при установке, как по умолчанию.\r\n\r\nК сведению, инсталлятор не может повторно использовать параметры\r\nиз предыдущей установки, если значение Uninstallable в "no", так как\r\nзаписи реестра не создаются при этом значении.
UsePreviousUserInfo=При значении "yes" в начале установки инсталлятор ищет в реестре,\r\nне была ли установлена данная программа на данном компьютере, и если\r\nтак, будет использовать имя пользователя, название организации и\r\nсерийный номер, которые ввел пользователь в прошлый раз при установке.\r\n\r\nК сведению, инсталлятор не может повторно использовать параметры\r\nиз предыдущей установки, если значение Uninstallable в "no", так как\r\nзаписи реестра не создаются при этом значении.
UserInfoPage=При значении "yes", инсталлятор отобразит страницу для ввода сведений\r\nо пользователе, в которой нужно указать данные (имя, организация и т.д.)\r\nПолученные значения будут присвоены константам {userinfoname}, {userinfoorg}\r\nи {userinfoserial}. Эти константы можно использовать в секциях [Registry]\r\nи [Ini] для сохранения и дальнейшего использования.
UseSetupLdr=Определяет тип установочной комплектации. При значении "yes", все\r\nнужные файлы сжимаются в SETUP.EXE. При значении "no", создается\r\nкак минимум три файла: SETUP.EXE, SETUP.0 и SETUP-1.BIN.\r\nИспользуется значение "no" только в случае отключения компонентов.\r\n\r\nОбратите внимание: UseSetupLdr=no не используется при разбиении\r\nна диски (DiskSpanning=yes).
VersionInfoCompany=Название компании для информации о дистрибутиве.
VersionInfoCopyright=Авторские права, отображаемые в информации о версии инсталлятора.
VersionInfoDescription=Описание файла(ов) дистрибутива.
VersionInfoProductName=Название продукта для информации о дистрибутиве.
VersionInfoProductTextVersion=Версия файла (текст) дистрибутива.
VersionInfoProductVersion=Определяет двоичное значение версии файла. Допускается часть цифр.\r\nНедостающие цифры будут добавлены как нули.\r\n\r\nОбратите внимание, что это значение будет выведено на экран Проводником\r\nна Windows Vista SP2. Другие версии выводят на экран текстовое значение\r\nверсии продукта (VersionInfoProductTextVersion) вместо этого.
VersionInfoTextVersion=Задает текстовый файл с описанием версии программы.\r\n\r\nВНИМАНИЕ, это значение отображается только на вкладке\r\nВерсия Проводника в Windows 98 и более ранних. Более поздние\r\nвыводят на экран двоичный номер версии (VersionInfoVersion).
VersionInfoVersion=Задает двоичное значение версии файла инсталлятора.\r\n\r\nНедостающие числа в указанной версии будут доставлены нулями.
WindowResizable=При значении "no" пользователю не придется менять размеры\r\nфонового окна инсталлятора когда оно развернуто.\r\n\r\nДиректива не работает, если WindowVisible не установлено в "yes".
WindowShowCaption=При значении "no" инсталлятор будет "полноэкранным"\r\n - без панели значений и границ, и будет поверх всех\r\nокон в панели задач.\r\n\r\nДиректива не работает, если WindowVisible не установлено в "yes".
WindowStartMaximized=При значении "yes" фоновое окно инсталлятора будет изначально\r\nразвернуто на весь экран, но не будет перекрывать панель задач.\r\n\r\nДиректива не работает, если WindowVisible не установлено в "yes".
WindowVisible=При значении "yes" позади окна мастера будет отображаться\r\nградиентное фоновое окно.\r\n\r\nОбратите внимание, что это считается устаревшей функцией\r\nи в будущем может быть удалено.
WizardImageBackColor=Эта директива определяет цвет фона, которым окрашивается все\r\nнезаполненное пространство вокруг большой картинки окна мастера\r\n(которое определяется директивой WizardImageFile). Незаполненное\r\nпространство появится только если WizardImageStretch=no.
WizardImageFile=Определяет картинку в формате .bmp, которая будет отображаться\nв левой части окна инсталлятора. Этот файл должен быть расположен\nв исходной папке скрипта, если только для него не указан полный\nпуть или нет приставки "compiler:" - в этом случае компилятор\nбудет искать указанный файл в своем каталоге.\n\n256-цветные картинки могут не отобразиться правильно в 256-цветном\nрежиме из-за скудности палитры. Максимальный размер картинки 164x314\nпикселей. Обратите внимание, что если в Windows задан Крупный шрифт,\nплощадь для картинки в окне мастера будет больше.
WizardImageStretch=Если выбрано (значение по умолчанию), изображения в инсталляторе\nбудут вытянуты или сжаты, если инсталлятор больше или меньше\nнормального, например если пользователь использует большие шрифты.\n\nЕсли не выбрано, изображения в инсталляторе будут центрированы в\nсоответствующих областях, если инсталлятор больше нормального,\nи обрезаны, если инсталлятор меньше нормального. (Это соответствует\nпо умолчанию для Inno Setup 4.1.2 и ранее.)
WizardSmallImageFile=Определяет картинку в формате .bmp, которая будет отображаться в\r\nправом верхнем углу окна мастера. Этот файл должен быть расположен\r\nв исходной папке скрипта, если только для него не указан полный\r\nпуть или нет приставки "compiler:" - в этом случае компилятор\r\nбудет искать указанный файл в своем каталоге.

